tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "asdf"
brew "docker"
brew "docker-compose"
brew "glib"
brew "jq"
brew "libpq"
brew "lima"
brew "mas"
brew "openconnect"
brew "poetry"
brew "pure"
brew "vpn-slice"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "heroku/brew/heroku"
cask "android-platform-tools"
cask "android-studio"
cask "chrome-remote-desktop-host"
cask "db-browser-for-sqlite"
cask "dropbox"
cask "google-chrome"
cask "google-drive"
cask "google-japanese-ime"
cask "iterm2"
cask "microsoft-remote-desktop"
cask "scroll-reverser"
cask "visual-studio-code"
cask "xbar"
cask "zoom"
mas "Bitwarden", id: 1352778147
mas "Display Menu", id: 549083868
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Sleep Control Center", id: 946798523
mas "Xcode", id: 497799835
