tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "readline"
brew "asdf"
brew "bash-completion"
brew "binutils"
brew "gawk"
brew "git"
brew "gnupg"
brew "mas"
brew "sqlite"
brew "xz"
brew "python@3.9"
brew "zlib"
brew "zstd"
cask "android-platform-tools"
cask "chrome-remote-desktop-host"
cask "db-browser-for-sqlite"
cask "dropbox"
cask "firefox"
cask "google-chrome"
cask "google-drive"
cask "google-japanese-ime"
cask "iterm2"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-remote-desktop"
cask "noxappplayer"
cask "scroll-reverser"
cask "virtualbox"
cask "visual-studio-code"
cask "xbar"
cask "zoom"
mas "Display Menu", id: 549083868
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Parallels Client", id: 600925318
mas "Sleep Control Center", id: 946798523
mas "Xcode", id: 497799835
