tap "chipmk/tap"
tap "hashicorp/tap"
brew "asdf"
brew "python@3.13"
brew "awscli"
brew "azure-cli"
brew "glib"
brew "docker"
brew "fzf"
brew "go"
brew "python@3.12"
brew "graphviz"
brew "helm"
brew "jq"
brew "kind"
brew "libpq"
brew "libslirp"
brew "libzip"
brew "lima"
brew "mas"
brew "maven"
brew "minikube"
brew "mysql-client"
brew "nmap"
brew "poetry"
brew "qemu"
brew "rclone"
brew "sheldon"
brew "hashicorp/tap/terraform"
cask "android-platform-tools"
cask "android-studio"
cask "bruno"
cask "chrome-remote-desktop-host"
cask "db-browser-for-sqlite"
cask "discord"
cask "dropbox"
cask "gcloud-cli"
cask "google-chrome"
cask "google-drive"
cask "google-japanese-ime"
cask "karabiner-elements"
cask "lens"
cask "microsoft-azure-storage-explorer"
cask "microsoft-edge"
cask "obsidian"
cask "pgadmin4"
cask "postman"
cask "rancher"
cask "scroll-reverser"
cask "slack"
cask "visual-studio-code"
cask "windows-app"
cask "xbar"
cask "zoom"
mas "Bitwarden", id: 1352778147
mas "Display Menu", id: 549083868
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Sleep Control Center", id: 946798523
mas "Xcode", id: 497799835
vscode "arjun.swagger-viewer"
vscode "bierner.markdown-mermaid"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "jebbs.plantuml"
vscode "leetcode.vscode-leetcode"
vscode "mitchdenny.ecdc"
vscode "ms-azuretools.vscode-containers"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-serial-monitor"
vscode "redhat.vscode-yaml"
vscode "tamasfe.even-better-toml"
